In [54]:
%config ZMQInteractiveShell.ast_node_interactivity ='all'

In [30]:
import pandas as pd
df_train = pd.read_csv('train.csv')

In [31]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [32]:
df_train.shape

(891, 12)

In [33]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [34]:
df_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### 特征工程
#### 0.缺失值处理

In [35]:
#fillna处理
df_train['Age'].fillna(value=df_train['Age'].mean())

In [36]:
# #Imputer处理
from sklearn.preprocessing import Imputer                                   
imp = Imputer(missing_values='NaN',strategy='mean',axis=0)
age = imp.fit_transform(df_train[['Age']].values)
df_train['Age']=age

In [41]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

#### 1.统计值处理

In [43]:
#最大最小
max_age = df_train['Age'].max()
min_age = df_train['Age'].min()
max_age,min_age

(80.0, 0.42)

#### 2.数值型加减乘除

In [46]:
df_train.loc[:,'family_size'] = df_train['SibSp']+df_train['Parch']+1
df_train.loc[:,'tmp'] = df_train['Age']*df_train['Pclass'] + 4*df_train['family_size']
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,family_size,tmp
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,74.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,46.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,82.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,43.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,109.0

#### 3.数值型高次特征和交叉特征

In [49]:
from sklearn.preprocessing import PolynomialFeatures
poly = PolynomialFeatures(degree=2)
poly_fea = poly.fit_transform(df_train[['SibSp','Parch']])
poly_fea

array([[1., 1., 0., 1., 0., 0.],
       [1., 1., 0., 1., 0., 0.],
       [1., 0., 0., 0., 0., 0.],
       ...,
       [1., 1., 2., 1., 2., 4.],
       [1., 0., 0., 0., 0., 0.],
       [1., 0., 0., 0., 0., 0.]])

#### 4.数值型离散化、分箱、分桶

In [50]:
#等距切分
df_train.loc[:,'fare_cut'] = pd.cut(df_train['Fare'],5)
df_train['fare_cut'].unique()

[(-0.512, 102.466], (204.932, 307.398], (102.466, 204.932], (409.863, 512.329]]
Categories (4, interval[float64]): [(-0.512, 102.466] < (102.466, 204.932] < (204.932, 307.398] < (409.863, 512.329]]

In [51]:
#等频切分
df_train.loc[:,'fare_qcut'] = pd.qcut(df_train['Fare'],5)
df_train['fare_qcut'].unique()

[(-0.001, 7.854], (39.688, 512.329], (7.854, 10.5], (10.5, 21.679], (21.679, 39.688]]
Categories (5, interval[float64]): [(-0.001, 7.854] < (7.854, 10.5] < (10.5, 21.679] < (21.679, 39.688] < (39.688, 512.329]]

#### 5.类别型独热向量编码

In [55]:
#pandas get_dummies
embarked_oht = pd.get_dummies(df_train[['Embarked']])
embarked_qcut_oht = pd.get_dummies(df_train[['fare_qcut']])
embarked_oht.head()
embarked_qcut_oht.head()

   Embarked_C  Embarked_Q  Embarked_S
0           0           0           1
1           1           0           0
2           0           0           1
3           0           0           1
4           0           0           1

,"fare_qcut_(-0.001, 7.854]","fare_qcut_(7.854, 10.5]","fare_qcut_(10.5, 21.679]","fare_qcut_(21.679, 39.688]","fare_qcut_(39.688, 512.329]"
0,1,0,0,0,0
1,0,0,0,0,1
2,0,1,0,0,0
3,0,0,0,0,1
4,0,1,0,0,0

#### 6.时间型

In [66]:
car_sales = pd.read_csv('car_data.csv')
car_sales['date_t'].dtype #查看数组类型
car_sales.loc[:,'date'] = pd.to_datetime(car_sales['date_t']) #转换为时间类型
car_sales.loc[:,'month'] = car_sales['date'].dt.month  #取出月份
car_sales.loc[:,'dom'] = car_sales['date'].dt.day  #取出一月中的第几天
car_sales.loc[:,'doy'] = car_sales['date'].dt.year  #取出一年中的第几天
car_sales.loc[:,'dow'] = car_sales['date'].dt.dayofweek  #星期几
car_sales.loc[:,'isweekend'] = car_sales['dow'].apply(lambda x:1 if (x==0 or x==6) else 0) #取出周末
car_sales.head()

dtype('O')

       date_t     cnt       date  month  dom   doy  dow  isweekend
0  2012-12-31     NaN 2012-12-31     12   31  2012    0          1
1  2013-01-01     NaN 2013-01-01      1    1  2013    1          0
2  2013-01-02    68.0 2013-01-02      1    2  2013    2          0
3  2013-01-03    36.0 2013-01-03      1    3  2013    3          0
4  2013-01-04  5565.0 2013-01-04      1    4  2013    4          0

#### 7.文本型

In [73]:
#词袋模型
from sklearn.feature_extraction.text import CountVectorizer
vectorizer = CountVectorizer()
corpus = ['This is a very good class','students are very very very good','This is the third sentence','Is this the last doc']
X = vectorizer.fit_transform(corpus)
vectorizer.get_feature_names()
X.toarray()  #向量化

#n-gram
vec = CountVectorizer(ngram_range=(1,3))
X_ngram = vec.fit_transform(corpus)
vec.get_feature_names()
X_ngram.toarray()

#TF-IDF
from sklearn.feature_extraction.text import TfidfVectorizer
tfidf_vec = TfidfVectorizer()
tfidf_X = tfidf_vec.fit_transform(corpus)
tfidf_vec.get_feature_names()
tfidf_X.toarray()

['are',
 'class',
 'doc',
 'good',
 'is',
 'last',
 'sentence',
 'students',
 'the',
 'third',
 'this',
 'very']

array([[0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1],
       [1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 3],
       [0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0],
       [0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0]], dtype=int64)

['are',
 'are very',
 'are very very',
 'class',
 'doc',
 'good',
 'good class',
 'is',
 'is the',
 'is the third',
 'is this',
 'is this the',
 'is very',
 'is very good',
 'last',
 'last doc',
 'sentence',
 'students',
 'students are',
 'students are very',
 'the',
 'the last',
 'the last doc',
 'the third',
 'the third sentence',
 'third',
 'third sentence',
 'this',
 'this is',
 'this is the',
 'this is very',
 'this the',
 'this the last',
 'very',
 'very good',
 'very good class',
 'very very',
 'very very good',
 'very very very']

array([[0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0],
       [1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 1, 0, 2, 1, 1],
       [0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0,
        0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1,
        1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0]], dtype=int64)

['are',
 'class',
 'doc',
 'good',
 'is',
 'last',
 'sentence',
 'students',
 'the',
 'third',
 'this',
 'very']

array([[0.        , 0.57184829, 0.        , 0.45085176, 0.36500336,
        0.        , 0.        , 0.        , 0.        , 0.        ,
        0.36500336, 0.45085176],
       [0.3488765 , 0.        , 0.        , 0.27505824, 0.        ,
        0.        , 0.        , 0.3488765 , 0.        , 0.        ,
        0.        , 0.82517473],
       [0.        , 0.        , 0.        , 0.        , 0.34432086,
        0.        , 0.53944516, 0.        , 0.42530476, 0.53944516,
        0.34432086, 0.        ],
       [0.        , 0.        , 0.53944516, 0.        , 0.34432086,
        0.53944516, 0.        , 0.        , 0.42530476, 0.        ,
        0.34432086, 0.        ]])

#### 7.组合特征

In [74]:
#借助条件去判断获取组合特征
df_train.loc[:,'alone'] = (df_train['SibSp']==0)&(df_train['Parch']==0)
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,family_size,tmp,fare_cut,fare_qcut,alone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,74.0,"(-0.512, 102.466]","(-0.001, 7.854]",False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,46.0,"(-0.512, 102.466]","(39.688, 512.329]",False
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,82.0,"(-0.512, 102.466]","(7.854, 10.5]",True
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,43.0,"(-0.512, 102.466]","(39.688, 512.329]",False
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,109.0,"(-0.512, 102.466]","(7.854, 10.5]",True

### 特征选择

#### 0.过滤型

In [75]:
from sklearn.feature_selection import SelectKBest
from sklearn.datasets import load_iris
iris = load_iris()
X,y = iris.data,iris.target
X.shape
X_new = SelectKBest(k=2).fit_transform(X,y)  #选取最好的两个特征
X_new.shape

(150, 4)

(150, 2)

#### 1.包裹型

In [78]:
from sklearn.feature_selection import RFE
from sklearn.ensemble import RandomForestClassifier
rf = RandomForestClassifier()
rfe = RFE(estimator=rf,n_features_to_select=2)  #用随机森林去筛选两个特征
X_ref = rfe.fit_transform(X,y)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\ensemble\forest.py:246: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)
C:\ProgramData\Anaconda3\lib\site-packages\sklearn\ensemble\forest.py:246: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)
C:\ProgramData\Anaconda3\lib\site-packages\sklearn\ensemble\forest.py:246: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)

#### 2.嵌入式

In [80]:
from sklearn.feature_selection import SelectFromModel
from sklearn.svm import LinearSVC
svc = LinearSVC(C=0.01,penalty='l1',dual=False).fit(X,y)
model = SelectFromModel(svc,prefit=True)  #用l1正则化的svm进行特征选择
X_embed = model.transform(X)
X_embed.shape

(150, 3)